const ABC = 1;

export const TMP_NEWS = {
  thumbnail:
    'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
  title: `"산유국 되나" 尹 한 마디에 한국석유 또 '上'…석유주 훨훨훨훨훨훨훨훨훨훨훨훨`,
  content: `윤석열 대통령이 "포항 앞바다에 막대한 양의 석유·천연가스
                매장 가능성이 있다"고 발표하면서 석유주가 이틀째
                급등했다.3일 한국석유(004090)는 전일대비 5350원(29.81%)
                오른 2만3300원에 거래를 마쳤다. 한국석유는 전날에도
                상한가로 장을 마친 바 있다.이 외에도 한국ANKOR유전도
                상한가를 찍었고, 흥구석유(024060)는 18.40% 올랐다.윤석열
                대통령은 전날 용산 대통령실에서 열린 국정 브리핑에서
                "포항 영일만 앞바다에 막대한 양의 석유와 가스가 매장돼
                있을 가능성이 높다는 물리탐사 결과가 나왔다"고
                밝혔다.매장량은 최대 140억 배럴 가능성이 예상되며
                천연가스는 29년, 석유는 4년 이상 사용할 양이라고
                설명했다.`,
  publishedTime: '6시간전',
  company: '문화일보',
  date: '2024-06-24T19:52:16.000Z',
  id: '1',
};

export const TMP_STOCKS = [
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '01.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },

  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '02.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '03.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '04.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '애플',
    subname: 'AAPL',
    value: '05.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '아마존',
    subname: 'AMAZ',
    value: '05.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '아마존1',
    subname: 'AMAZ',
    value: '05.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '아마존2',
    subname: 'AMAZ',
    value: '05.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '111',
    name: '마이크로소프트',
    subname: 'MCSF',
    value: '05.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
  {
    id: '1112',
    name: '삼성전자',
    subname: 'SAMS',
    value: '05.00',
    tmp1: -0.82,
    tmp2: 1.75,
  },
];

export const TMP_NEWS_LIST = [
  {
    id: '1',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title: `"산유국 되나" 尹 한 마디에 한국석유 또 '上'…석유주 훨훨훨훨훨훨훨훨훨훨훨훨`,
    content: `윤석열 대통령이 "포항 앞바다에 막대한 양의 석유·천연가스
                매장 가능성이 있다"고 발표하면서 석유주가 이틀째
                급등했다.3일 한국석유(004090)는 전일대비 5350원(29.81%)
                오른 2만3300원에 거래를 마쳤다. 한국석유는 전날에도
                상한가로 장을 마친 바 있다.이 외에도 한국ANKOR유전도
                상한가를 찍었고, 흥구석유(024060)는 18.40% 올랐다.윤석열
                대통령은 전날 용산 대통령실에서 열린 국정 브리핑에서
                "포항 영일만 앞바다에 막대한 양의 석유와 가스가 매장돼
                있을 가능성이 높다는 물리탐사 결과가 나왔다"고
                밝혔다.매장량은 최대 140억 배럴 가능성이 예상되며
                천연가스는 29년, 석유는 4년 이상 사용할 양이라고
                설명했다.`,
    publisher: '문화일보',
    date: '2024-06-24T19:52:16.000Z',
  },
  {
    id: '2',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title: `"신재생에너지 대박" 韓, 태양광 발전소 증가... 관련 주 상승`,
    content: `최근 한국 정부가 대규모 태양광 발전소 건설 계획을 발표하면서
                신재생에너지 관련 주가가 급등하고 있다.4일 신재생에너지주
                중 하나인 한국태양광(003280)은 전일대비 4500원(25.30%)
                오른 2만2500원에 거래를 마쳤다. 한국태양광은 전날에도
                상한가로 장을 마친 바 있다.이 외에도 한국풍력발전도
                상한가를 기록했고, 그린에너지(024010)는 15.40% 올랐다.
                정부는 이번 발표를 통해 "신재생에너지 발전 비중을
                대폭 확대해 나갈 계획"이라며 "태양광과 풍력 발전을
                통해 지속 가능한 에너지 공급을 목표로 하고 있다"고
                밝혔다. 계획된 발전소는 총 50곳이며, 이를 통해 연간
                200억 kWh의 전력을 생산할 것으로 예상된다.`,
    publisher: '한국경제',
    date: '2024-06-25T04:30:00.000Z',
  },
  {
    id: '3',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title: "애플, 혁신적인 '애플 글래스' 공개…AR 시장 판도 바뀌나",
    content:
      "애플이 드디어 '애플 글래스'를 공개했다. 이 새로운 AR 기기는 혁신적인 기능과 세련된 디자인으로 큰 주목을 받고 있다. 팀 쿡 애플 CEO는 '애플 글래스'가 새로운 차원의 사용자 경험을 제공할 것이라고 말했다. 이번 발표로 AR 시장의 판도가 크게 바뀔 것으로 예상된다.",
    publisher: '전자신문',
    date: '2024-06-25T09:00:00.000Z',
  },
  {
    id: '4',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title: "애플, 전기차 프로젝트 '타이탄' 속도 낸다…내년 출시 목표",
    content:
      "애플이 비밀리에 진행 중인 전기차 프로젝트 '타이탄'의 속도를 내고 있다. 업계 관계자에 따르면 애플은 내년 전기차 출시를 목표로 하고 있으며, 자율주행 기술과 혁신적인 배터리 기술을 탑재할 예정이라고 전했다. 이는 전기차 시장에 큰 변화를 가져올 것으로 보인다.",
    publisher: '한국경제',
    date: '2024-06-25T11:30:00.000Z',
  },
  {
    id: '5',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title: '애플, 신형 맥북 프로 발표…M3 칩셋 장착',
    content:
      '애플이 신형 맥북 프로를 발표했다. 이번 모델은 새로운 M3 칩셋을 장착해 성능이 대폭 향상되었다. 애플은 이번 신형 맥북 프로가 더욱 빠르고 강력한 성능을 제공할 것이라고 밝혔다. 또한, 배터리 수명도 대폭 개선되었다.',
    publisher: '머니투데이',
    date: '2024-06-26T14:00:00.000Z',
  },
  {
    id: '6',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title: "애플, '애플 페이' 한국 출시…모바일 결제 시장 흔들리나",
    content:
      "애플이 드디어 '애플 페이'를 한국 시장에 출시했다. 이로 인해 모바일 결제 시장에 큰 변화가 예상된다. 애플 페이는 간편한 사용성과 높은 보안성으로 많은 사용자들의 주목을 받고 있다. 이에 따라 국내 경쟁사들도 긴장하고 있다.",
    publisher: '중앙일보',
    date: '2024-06-27T16:00:00.000Z',
  },
  {
    id: '7',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title: '아마존, 드론 배송 서비스 시작…물류 혁명 예고',
    content:
      '아마존이 드론 배송 서비스를 공식적으로 시작했다. 이번 서비스는 빠르고 효율적인 물류 혁명을 예고하고 있다. 제프 베조스 아마존 CEO는 드론 배송이 고객에게 더 빠르고 정확한 배송 경험을 제공할 것이라고 말했다.',
    publisher: '파이낸셜타임즈',
    date: '2024-06-24T09:00:00.000Z',
  },
  {
    id: '8',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title:
      '아마존, 클라우드 시장에서의 입지 강화…새로운 데이터 센터 오픈',
    content:
      '아마존 웹 서비스(AWS)가 새로운 데이터 센터를 오픈하며 클라우드 시장에서의 입지를 강화하고 있다. 이번 데이터 센터 오픈으로 인해 아마존은 더욱 안정적이고 신뢰성 높은 서비스를 제공할 수 있게 되었다. 클라우드 시장의 경쟁이 한층 치열해질 것으로 예상된다.',
    publisher: '조선비즈',
    date: '2024-06-25T11:30:00.000Z',
  },
  {
    id: '9',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title: '아마존, 인공지능 연구소 설립…AI 기술 개발 박차',
    content:
      '아마존이 인공지능(AI) 연구소를 설립하며 AI 기술 개발에 박차를 가하고 있다. 아마존은 이번 연구소 설립을 통해 AI 분야에서의 기술 혁신과 발전을 도모할 예정이다. 이는 AI 기술의 발전과 함께 다양한 산업에 큰 영향을 미칠 것으로 기대된다.',
    publisher: '매일경제',
    date: '2024-06-26T14:00:00.000Z',
  },
  {
    id: '10',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title:
      '아마존 프라임 데이, 기록적인 매출 달성…전자상거래 시장 활기',
    content:
      "아마존의 연례 할인 행사인 '프라임 데이'가 기록적인 매출을 달성했다. 이번 행사로 인해 아마존은 전자상거래 시장에서의 강력한 입지를 다시 한 번 확인했다. 다양한 제품이 큰 할인을 받아 많은 소비자들이 이번 기회를 놓치지 않았다.",
    publisher: '연합뉴스',
    date: '2024-06-27T16:00:00.000Z',
  },
  {
    id: '10',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title:
      '아마존 프라임 데이, 기록적인 매출 달성…전자상거래 시장 활기인줄 알았지?',
    content:
      "아마존의 연례 할인 행사인 '프라임 데이'가 기록적인 매출을 달성했다. 이번 행사로 인해 아마존은 전자상거래 시장에서의 강력한 입지를 다시 한 번 확인했다. 다양한 제품이 큰 할인을 받아 많은 소비자들이 이번 기회를 놓치지 않았다.",
    publisher: '연합뉴스',
    date: '2024-06-28T03:00:00.000Z',
  },
  {
    id: '11',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title: '마이크로소프트, 차세대 윈도우 발표…사용자 경험 대폭 개선',
    content:
      '마이크로소프트가 차세대 윈도우 운영체제를 발표했다. 이번 윈도우는 사용자 경험을 대폭 개선한 다양한 기능을 제공한다. 사티아 나델라 마이크로소프트 CEO는 이번 업데이트가 사용자들에게 보다 직관적이고 효율적인 컴퓨팅 환경을 제공할 것이라고 밝혔다.',
    publisher: 'ZDNet Korea',
    date: '2024-06-26T09:00:00.000Z',
  },
  {
    id: '12',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title:
      '마이크로소프트, 오픈AI와 협력 강화…AI 연구 및 개발 가속화',
    content:
      '마이크로소프트가 오픈AI와의 협력을 강화하며 AI 연구 및 개발을 가속화하고 있다. 이번 협력 강화로 마이크로소프트는 AI 분야에서의 혁신을 더욱 빠르게 이룰 수 있을 것으로 보인다. 이는 다양한 산업 분야에 큰 영향을 미칠 전망이다.',
    publisher: '한국경제',
    date: '2024-06-28T03:20:00.000Z',
  },
  {
    id: '13',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title:
      '마이크로소프트, 클라우드 게임 서비스 확장…게임 시장 판도 변화 예고',
    content:
      '마이크로소프트가 클라우드 게임 서비스를 대폭 확장하며 게임 시장의 판도를 바꾸고 있다. 엑스박스 클라우드 게이밍 서비스는 이제 더 많은 게임과 더 많은 국가에서 이용 가능하다. 이는 게임 산업에 큰 변화를 가져올 것으로 예상된다.',
    publisher: '서울경제',
    date: '2024-06-28T00:00:00.000Z',
  },
  {
    id: '14',
    thumbnail:
      'https://cdn.pixabay.com/photo/2024/06/06/13/25/black-tailed-skimmer-8812720_1280.jpg',
    title: '마이크로소프트, 사이버 보안 강화 위해 대규모 투자 단행',
    content:
      '마이크로소프트가 사이버 보안 강화를 위해 대규모 투자를 단행했다. 이번 투자로 마이크로소프트는 더 안전하고 신뢰성 높은 서비스를 제공할 계획이다. 이는 사이버 보안 위협이 증가하는 가운데 매우 중요한 조치로 평가된다.',
    publisher: '디지털데일리',
    date: '2024-06-28T16:00:00.000Z',
  },
];

export const TMP_CHATBOT: { role: 'bot' | 'user'; text: string }[] = [
  {
    role: 'bot',
    text: '안녕하세요 아인사우 챗봇입니다. 해외주식 관련해서 궁금하신 점이 있으면 저에게 물어보세요!',
  },
  {
    role: 'user',
    text: '애플의 주요 매출처는 어떤 곳들인가요?',
  },
  {
    role: 'bot',
    text: '애플의 주요 매출처에 대한 구체적인 정보를 찾지 못했습니다.양해 부탁드리며,다른 주제로 도와드릴 내용이 있으면 알려주세요.',
  },
  {
    role: 'user',
    text: '테슬라의 주가를 분석해줘',
  },
  {
    role: 'bot',
    text: '테슬라의 주가를 분석한 리포트가 있습니다. 다만 투자 결정을 내리기 전에 전문가나 금융 자문가와 상담하는 것이 좋습니다.',
  },
  {
    role: 'bot',
    text: '테슬라의 주가를 분석한 리포트가 있습니다. 다만 투자 결정을 내리기 전에 전문가나 금융 자문가와 상담하는 것이 좋습니다.',
  },
];
